{
    "data": [
        {
            "issue-name": "Locked Vault Monster",
            "issue-description": "<p class='info'>After completing <i>The Challenge</i> inside the vault of secrets, you unlock access to the basement. This basement includes a softlock which many players have encountered.</p> <p class='info'>If you are not aware, the basement has 3 locks which the player can unlock to free a prisoner. Each of these keys have their own unique ID. If the player has the key inside of their save data, the game sets a flag known as a <b>ugv</b> inside your save data as seen in the image below: <br><img href='https://imgur.com/a/FxNDTVJ'><br>Unlocking a key removes the lock from the layer making it impossible to click the button again. If all 3 keys are unlocked, the game triggers an event which frees the prisoner.<br><img href='https://imgur.com/a/7I0qAcE'><br>The flag for this event is set after the dialog with the prisoner ends meaning interupting the event by closing the game stops the flag from ever being set. The trigger for the event is only triggered during the <b>SecretLayer3::onClick</b> method as seen below <br> <img href='https://imgur.com/a/4uySHOk'><br>Since the locks were removed due to unlocking them previously, it is impossible to call the onClick method to restart the cutscene. As a result, the game becomes softlocked.</p>",
            "issue-fix": "<p class='info'>There are 2 fixes that you can try to solve this issue. One option is to re-complete the event inside of Geometry Dash World and then merge your save data. This is the easiest way to fix the issue. Alternatively, if you are somehow unable to use Geometry Dash World. Using external tools to insert the event into your save data can solve the issue.</p><p class='info'>The GD World method is quite simple. Firstly you log into your GD account however you <b>do not</b> load your save data. You then unlock all the keys in GD world and free the prisoner. Once the flag is set, load your save data - the flag will merge into your save data by doing this. After the data is loaded you save and the softlock should be fixed!</p> <p class='info'>Alternatively, you can use external tools. here is a <a href='https://github.com/Wyliemaster/GD-Demon-Softlock-fix'>Tested Tool</a></p>"
        }
    ]
}