{
    "data": [
        {
            "issue-name": "Locked Vault Monster",
            "issue-description": "<p class='info'>After completing <i>The Challenge</i> inside the vault of secrets, you unlock access to the basement. This basement includes a softlock which many players have encountered.</p> <p class='info'>If you are not aware, the basement has 3 locks which the player can unlock to free a prisoner. Each of these keys have their own unique ID. If the player has the key inside of their save data, the game sets a flag known as a <b>ugv</b> inside your save data as seen in the image below: <br><img src='https://media.discordapp.net/attachments/679480239503704101/957029905542021180/keys.PNG'><br>Unlocking a key removes the lock from the layer making it impossible to click the button again. If all 3 keys are unlocked, the game triggers an event which frees the prisoner.<br><img src='https://media.discordapp.net/attachments/679480239503704101/957029905906933900/UnlockAnim.PNG'><br>The flag for this event is set after the dialog with the prisoner ends meaning interupting the event by closing the game stops the flag from ever being set. The trigger for the event is only triggered during the <b>SecretLayer3::onClick</b> method as seen below <br> <img src='https://media.discordapp.net/attachments/679480239503704101/957029906221498498/xref.PNG'><br>Since the locks were removed due to unlocking them previously, it is impossible to call the onClick method to restart the cutscene. As a result, the game becomes softlocked.</p>",
            "issue-fix": "<p class='info'>There are 2 fixes that you can try to solve this issue. One option is to re-complete the event inside of Geometry Dash World and then merge your save data. This is the easiest way to fix the issue. Alternatively, if you are somehow unable to use Geometry Dash World. Using external tools to insert the event into your save data can solve the issue.</p><p class='info'>The GD World method is quite simple. Firstly you log into your GD account however you <b>do not</b> load your save data. You then unlock all the keys in GD world and free the prisoner. Once the flag is set, load your save data - the flag will merge into your save data by doing this. After the data is loaded you save and the softlock should be fixed!</p> <p class='info'>Alternatively, you can use external tools. here is a <a href='https://github.com/Wyliemaster/GD-Demon-Softlock-fix'>Tested Tool</a></p>",
            "id": 0,
            "type":"BUG"
        },
    
        {
            "issue-name": "Missing Stats",
            "issue-description": "<p class='info'>A Common issue people face is that they lose stats from previous playing sessions. This is an anticheat measure put in place by RobTop. <br><img src='https://cdn.discordapp.com/attachments/831110328066506783/957034763368157204/unknown.png'><br>The conditions to trigger the anticheat are pretty simple </p><ul class='info'><li>Rewarded stars are greater than 7</li><li>Total Jumps are less than 50</li><li>Attempt count is less than 10</li></ul><p class='info'>If all of these conditions are met, the level is uncompleted resulting in stat loss</p>",
            "issue-fix": "<p class='info'>The best way to bypass this anticheat would be to either waste 10 attempts at the start of levels or jump atleast 50 times inside the level before closing the game</p>",
            "id": 1,
            "type":"BUG"
        },

        {
            "issue-name":"Save Bug",
            "issue-description": "<p class='info'>When save data gets loaded into memory, it uses a system called paging. Pages are fixed sized pieces of memory which hold small segments of data. Since a page is small, save data is split into segments and scattered across memory. If data is smaller than the allocated space then the excess data will not be used as seen in the diagram below</p><img src='https://media.discordapp.net/attachments/679480239503704101/957356380673695835/unknown.png'><p class='info'>When a save file is read, Geometry Dash uses a NULL byte <b>(\\x00)</b> to determine when to stop reading. If there is no NULL byte at the end of the data, the game will continue reading data indefinitely until it does not have permission to read the data it reaches. One of the most common reasons for this bug is due to the way the game decrypts save data</p><p class='info'> Everyime the game is opened, the game calls a <b>cocos2d::ZipUtils::decompressString2</b> method which decrypts the save data.</p><img src='https://media.discordapp.net/attachments/679480239503704101/957349784400850944/decompress1.PNG'><p class='info'>The important argument in this method is the <b>0xB</b> which is the encryption key for the save data. The first step the game takes to decrypting save data using a method called <b>cocos2d::ZipUtils::encryptDecrypt</b> which uses the encryption key to decrypt the data</p><img src='https://media.discordapp.net/attachments/679480239503704101/957350803016937543/decompress2.PNG'><p class='info'>The method of encryption RobTop uses for GD is <a href='https://en.wikipedia.org/wiki/XOR_cipher'>xor cipher</a> which toggles the enabled bits of the encryption key in the data. As a result of this, the NULL byte at the end of the save data has an xor cipher operated on it and it changes from <b>'\\x00' => '\\0xB'</b>.</p><p class='info'>Luckily, free data within pages are usually set with NULL bytes for safety stopping the bug from happening every single time however, on rare ocassions, save data perfectly alligns with the size of the page so there is nothing to stop the game reading data</p>",
            "issue-fix": "<p class='info'>Although it is impossible to avoid this bug without directly modifying your Geometry Dash client. It is possible to restore your save data. Editing the size of the save file would mis-align the data from the pages allowing the game to read the save data. a <a href='https://github.com/WEGFan/Geometry-Dash-Savefile-Fix/releases'>tool</a> by <a href='https://github.com/WEGFan'>WEGFan</a> will do this for you</p>",
            "id": 2,
            "type":"BUG"
        },

        {
            "issue-name":"Noclip Detection",
            "issue-description":"<p class='info'>When you load a level, the game always adds a secret object to the player's starting position. This secret object does not have a texture assigned to it however, it uses the object ID for spikes.</p><img src='https://media.discordapp.net/attachments/798945974470311949/959558546477953082/unknown.png'><p class='info'>Robert did this in order to add a hitbox to the player's starting position</p> <img src='https://media.discordapp.net/attachments/798945974470311949/959557925301551115/unknown.png'><p class='info'>The reason for this is to have the player collide with an object. As seen in the example below, if the object which the player has collided with has the same ID as the secret object, a flag is set</p><img src='https://cdn.discordapp.com/attachments/798945974470311949/959560187058995292/unknown.png'><p class='info'>While this flag is set, the game believes that the player is not cheating. As seen in the image below, if this flag is not set, the game force quits the level stopping the player from completing it.</p><img src='https://media.discordapp.net/attachments/798945974470311949/959561343667675196/unknown.png'>",
            "issue-fix":"This can be bypassed by removing the check via modifications",
            "id": 3,
            "type":"INFO"
        }
    ]
}